app/Http/Controllers/ElementClassController.php

    public function index()
    {
        $elementClasses = ElementClasses::all();
---
select * from `element_classes`