app/Http/Controllers/GitCommitController.php

    public function index(Request $request)
    {
        $query = GitCommit::query();

        // Apply filters based on search input
        if ($request->has('branch')) {
            $query->where('branch', 'like', '%' . $request->branch . '%');
        }
        if ($request->has('safdarCoded')) {
            $query->where('safdarCoded', 'like', '%' . $request->safdarCoded . '%');
        }
        if ($request->has('gitCode')) {
            $query->where('gitCode', 'like', '%' . $request->gitCode . '%');
        }
        if ($request->has('commitMessage')) {
            $query->where('commitMessage', 'like', '%' . $request->commitMessage . '%');
        }

        // Get the results
        $gitCommits = $query->paginate(10); // Pagination for better navigation
---
select * from `git_commits` limit 10 offset 0
select count(*) as aggregate from `git_commits`